zevero/avr_boot/avr/boards.txt
##############################################################

menu.model=Model
menu.clock=Clock
menu.SDCS=SD CS Pin
menu.BOD=BOD
menu.pinout=Pinout
menu.processor=Processor

##############################################################

avr_boot_atmega328p.name=ATmega328P

avr_boot_atmega328p.upload.tool=arduino:avrdude
avr_boot_atmega328p.upload.maximum_data_size=2048
avr_boot_atmega328p.upload.maximum_size=28672

avr_boot_atmega328p.bootloader.tool=arduino:avrdude
avr_boot_atmega328p.bootloader.high_fuses=0xD8
avr_boot_atmega328p.bootloader.unlock_bits=0x3F
avr_boot_atmega328p.bootloader.lock_bits=0x0F

avr_boot_atmega328p.build.mcu=atmega328p
avr_boot_atmega328p.build.core=arduino:arduino
avr_boot_atmega328p.build.board=AVR_ATMEGA328P

# Model Menu
avr_boot_atmega328p.menu.model.uno=Uno
avr_boot_atmega328p.menu.model.uno.build.variant=arduino:standard
avr_boot_atmega328p.menu.model.uno.build.board=AVR_UNO

avr_boot_atmega328p.menu.model.duemilanove=Duemilanove or Diecimila
avr_boot_atmega328p.menu.model.duemilanove.build.variant=arduino:standard
avr_boot_atmega328p.menu.model.duemilanove.build.board=AVR_DUEMILANOVE

avr_boot_atmega328p.menu.model.nano=Nano
avr_boot_atmega328p.menu.model.nano.build.variant=arduino:eightanaloginputs
avr_boot_atmega328p.menu.model.nano.build.board=AVR_NANO

avr_boot_atmega328p.menu.model.mini=Mini
avr_boot_atmega328p.menu.model.mini.build.variant=arduino:eightanaloginputs
avr_boot_atmega328p.menu.model.mini.build.board=AVR_MINI

avr_boot_atmega328p.menu.model.ethernet=Ethernet
avr_boot_atmega328p.menu.model.ethernet.build.variant=arduino:ethernet
avr_boot_atmega328p.menu.model.ethernet.build.board=AVR_ETHERNET

avr_boot_atmega328p.menu.model.bt=BT
avr_boot_atmega328p.menu.model.bt.build.variant=arduino:eightanaloginputs
avr_boot_atmega328p.menu.model.bt.build.board=AVR_BT

avr_boot_atmega328p.menu.model.pro=Pro or Pro Mini
avr_boot_atmega328p.menu.model.pro.build.variant=arduino:eightanaloginputs
avr_boot_atmega328p.menu.model.pro.build.board=AVR_PRO

avr_boot_atmega328p.menu.model.other6=Other(6 analog inputs)
avr_boot_atmega328p.menu.model.other6.build.variant=arduino:standard
avr_boot_atmega328p.menu.model.other6.build.board=AVR_OTHER_6_ANALOG

avr_boot_atmega328p.menu.model.other8=Other(8 analog inputs)
avr_boot_atmega328p.menu.model.other8.build.variant=arduino:eightanaloginputs
avr_boot_atmega328p.menu.model.other8.build.board=AVR_PRO

# Clock Menu
avr_boot_atmega328p.menu.clock.16mhz_low_power=16MHz External Low Power
avr_boot_atmega328p.menu.clock.16mhz_low_power.bootloader.low_fuses=0xFF
avr_boot_atmega328p.menu.clock.16mhz_low_power.build.f_cpu=16000000L

avr_boot_atmega328p.menu.clock.16mhz_full_swing=16MHz External Full Swing
avr_boot_atmega328p.menu.clock.16mhz_full_swing.bootloader.low_fuses=0xF7
avr_boot_atmega328p.menu.clock.16mhz_full_swing.build.f_cpu=16000000L

avr_boot_atmega328p.menu.clock.20mhz=20MHz External
avr_boot_atmega328p.menu.clock.20mhz.bootloader.low_fuses=0xF7
avr_boot_atmega328p.menu.clock.20mhz.build.f_cpu=20000000L

avr_boot_atmega328p.menu.clock.8mhz_low_power=8MHz External Low Power
avr_boot_atmega328p.menu.clock.8mhz_low_power.bootloader.low_fuses=0xFF
avr_boot_atmega328p.menu.clock.8mhz_low_power.build.f_cpu=8000000L

avr_boot_atmega328p.menu.clock.8mhz_full_swing=8MHz External Full Swing
avr_boot_atmega328p.menu.clock.8mhz_full_swing.bootloader.low_fuses=0xF7
avr_boot_atmega328p.menu.clock.8mhz_full_swing.build.f_cpu=8000000L

avr_boot_atmega328p.menu.clock.8mhz_internal=8MHz Internal
avr_boot_atmega328p.menu.clock.8mhz_internal.bootloader.low_fuses=0xE2
avr_boot_atmega328p.menu.clock.8mhz_internal.build.f_cpu=8000000L

#SD CS Pin Menu
avr_boot_atmega328p.menu.SDCS.4=4
avr_boot_atmega328p.menu.SDCS.4.cs_pin=4

avr_boot_atmega328p.menu.SDCS.8=8
avr_boot_atmega328p.menu.SDCS.8.cs_pin=8

avr_boot_atmega328p.menu.SDCS.10=10
avr_boot_atmega328p.menu.SDCS.10.cs_pin=10

# BOD Menu
avr_boot_atmega328p.menu.BOD.2_7=2.7V
avr_boot_atmega328p.menu.BOD.2_7.bootloader.extended_fuses=0x05

avr_boot_atmega328p.menu.BOD.4_3=4.3V
avr_boot_atmega328p.menu.BOD.4_3.bootloader.extended_fuses=0xFC

avr_boot_atmega328p.menu.BOD.1_8=1.8V
avr_boot_atmega328p.menu.BOD.1_8.bootloader.extended_fuses=0xFE

avr_boot_atmega328p.menu.BOD.off=Off
avr_boot_atmega328p.menu.BOD.off.bootloader.extended_fuses=0xFF

avr_boot_atmega328p.bootloader.file={build.mcu}_cs{cs_pin}_{build.f_cpu}.hex

##############################################################

avr_boot_atmega32u4.name=ATmega32U4

avr_boot_atmega32u4.upload.tool=arduino:avrdude
avr_boot_atmega32u4.upload.maximum_size=28672
avr_boot_atmega32u4.upload.maximum_data_size=2560

avr_boot_atmega32u4.bootloader.tool=arduino:avrdude
avr_boot_atmega32u4.bootloader.high_fuses=0xD8
avr_boot_atmega32u4.bootloader.unlock_bits=0x3F
avr_boot_atmega32u4.bootloader.lock_bits=0x2F

avr_boot_atmega32u4.build.mcu=atmega32u4
avr_boot_atmega32u4.build.core=arduino:arduino
avr_boot_atmega32u4.build.extra_flags={build.usb_flags}
avr_boot_atmega32u4.build.board=AVR_ATMEGA32U4

# Model Menu
avr_boot_atmega32u4.menu.model.leonardo=Leonardo
avr_boot_atmega32u4.menu.model.leonardo.build.vid=0x2341
avr_boot_atmega32u4.menu.model.leonardo.build.pid=0x8036
avr_boot_atmega32u4.menu.model.leonardo.build.usb_product="Arduino Leonardo"
avr_boot_atmega32u4.menu.model.leonardo.build.variant=arduino:leonardo
avr_boot_atmega32u4.menu.model.leonardo.build.board=AVR_LEONARDO

avr_boot_atmega32u4.menu.model.micro=Micro
avr_boot_atmega32u4.menu.model.micro.build.vid=0x2341
avr_boot_atmega32u4.menu.model.micro.build.pid=0x8037
avr_boot_atmega32u4.menu.model.micro.build.usb_product="Arduino Micro"
avr_boot_atmega32u4.menu.model.micro.build.variant=arduino:micro
avr_boot_atmega32u4.menu.model.micro.build.board=AVR_MICRO

# Clock Menu
avr_boot_atmega32u4.menu.clock.16mhz=16MHz External
avr_boot_atmega32u4.menu.clock.16mhz.bootloader.low_fuses=0xFF
avr_boot_atmega32u4.menu.clock.16mhz.build.f_cpu=16000000L

avr_boot_atmega32u4.menu.clock.8mhz_external=8MHz External
avr_boot_atmega32u4.menu.clock.8mhz_external.bootloader.low_fuses=0xFF
avr_boot_atmega32u4.menu.clock.8mhz_external.build.f_cpu=8000000L

avr_boot_atmega32u4.menu.clock.8mhz_internal=8MHz Internal
avr_boot_atmega32u4.menu.clock.8mhz_internal.bootloader.low_fuses=0xE2
avr_boot_atmega32u4.menu.clock.8mhz_internal.build.f_cpu=8000000L

# SD CS Pin Menu
avr_boot_atmega32u4.menu.SDCS.4=4
avr_boot_atmega32u4.menu.SDCS.4.cs_pin=4

